## **Pandas Practice**

**Load data into Data Frame**

In [0]:
import pandas as pd

#for csv file
df = pd.read_csv('Mall_Customers.csv')

#for excel file
df_excel = pd.read_excel('Mall_Customers.xlsx')

#for txt file
#use delimiter 
df_txt =  pd.read_csv('Mall_Customers.txt', delimiter='\t')

In [2]:
df.head(3)

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6

In [3]:
df_excel.head(5)

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [4]:
df_txt.head(5)

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [5]:
#to know all columns inside data frame we can use script below
#also we can store all columns name into a list as below
print(df.columns)
columns = list(df.columns.values)
columns

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

['CustomerID', 'Gender', 'Age', 'Annual Income (k$)', 'Spending Score (1-100)']

In [6]:
for col in columns:
  print(col)

CustomerID
Gender
Age
Annual Income (k$)
Spending Score (1-100)

**We can accessing spesific columns as below**

In [7]:
df[['Gender','Age','Annual Income (k$)']]

     Gender  Age  Annual Income (k$)
0      Male   19                  15
1      Male   21                  15
2    Female   20                  16
3    Female   23                  16
4    Female   31                  17
..      ...  ...                 ...
195  Female   35                 120
196  Female   45                 126
197    Male   32                 126
198    Male   32                 137
199    Male   30                 137

[200 rows x 3 columns]